InformationRegisters/EDR_СоответствияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_СоответствияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Intervention</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Comment>Служебное поле, нужно для уникальности записей.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_СоответствияИнвойсов/Ext/ManagerModule.bsl
Процедура ЗаписатьСоответствие(Параметры) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_СоответствияИнвойсов.Invoice КАК Invoice
	|ИЗ
	|	РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|ГДЕ
	|	EDR_СоответствияИнвойсов.ЗаказНаряд = &ЗаказНаряд
	|	И EDR_СоответствияИнвойсов.Intervention = &Intervention
	|	И EDR_СоответствияИнвойсов.Invoice = &Invoice"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд",Параметры["ЗаказНаряд"]);
	Запрос.УстановитьПараметр("Intervention", Параметры["GUID"]);
	Запрос.УстановитьПараметр("Invoice", Параметры["GUID_Invoice"]);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() тогда //Если записей нет, создаем
		МЗ = РегистрыСведений.EDR_СоответствияИнвойсов.СоздатьМенеджерЗаписи();
		МЗ.GUID			= Строка(Новый УникальныйИдентификатор());
		МЗ.ЗаказНаряд	= Параметры["ЗаказНаряд"];
		МЗ.Intervention = Параметры["GUID"];
		МЗ.Invoice		= Параметры["GUID_Invoice"];
		МЗ.Процент		= Параметры["Процент"];
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСоответствие(Параметры) Экспорт
	
	//МЗ = РегистрыСведений.EDR_СоответствияИнвойсов.СоздатьМенеджерЗаписи();
	//ЗаполнитьЗначенияСвойств(МЗ,Параметры,"GUID,ЗаказНаряд,intervention,Invoice");
	//МЗ.Прочитать();
	//
	//ЗаполнитьЗначенияСвойств(МЗ,Параметры);
	//МЗ.Записать(Истина);
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(Параметры["ЗаказНаряд"]);
	НЗ.Отбор.GUID.Установить(Параметры["GUID"]);
	НЗ.Прочитать();
	
	НЗ.Очистить();
	
	Стр = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(Стр, Параметры);
	
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьСоответствие(ИдентификаторСоответствия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСоответствия) Тогда
		Возврат;
	КонецЕсли;
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(ИдентификаторСоответствия);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();

КонецПроцедуры

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд) Тогда
		Возврат;
	КонецЕсли;
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
